[
  {
    "Id": "644ce6051e2c5fd6f373aec2",
    "Title": "Eyes Wide Shut",
    "Description": "In this drama by director Stanley Kubrick, Dr. William Harford and his wife Alice confront sexual and emotional temptations that pull them away from their normal lives. They explore the dark side of sexuality, which leads to unpredictable consequences.",
    "PhotoName": "Eyes Wide Shut_644ce6051e2c5fd6f373aec1.png",
    "Genre": 4,
    "ReleaseDate": "1999-07-16T12:38:56.89",
    "AgeRating": 3
  },
  {
    "Id": "644ce73e1e2c5fd6f373aec4",
    "Title": "Blade runner 1982",
    "Description": "Rick Deckard, a former cop, now works as a replicant hunter - humanoid robots created for specific tasks. He is tasked to track down and destroy four rogue replicants, but in the process, he begins to question the meaning of his own life.",
    "PhotoName": "Blade runner 1982_644ce73e1e2c5fd6f373aec3.png",
    "Genre": 1,
    "ReleaseDate": "1982-06-25T12:41:03.099",
    "AgeRating": 3
  },
  {
    "Id": "644ce7f71e2c5fd6f373aec6",
    "Title": "Blade Runner 2049",
    "Description": "Thirty years after the events of the first film, a new replicant hunter, K, uncovers a dark secret that could shake what\u0027s left of society. His search leads him to former rogue replicant Rick Deckard, who disappeared many years ago.",
    "PhotoName": "Blade Runner 2049_644ce7f71e2c5fd6f373aec5.png",
    "Genre": 4,
    "ReleaseDate": "2017-10-06T12:46:06.666",
    "AgeRating": 4
  },
  {
    "Id": "644ce9b11e2c5fd6f373aec8",
    "Title": "Full Metal Jacket",
    "Description": "The film depicts the harsh training conditions of young soldiers during the Vietnam War. The plot is divided into two parts: the first shows brutal military training on Parris Island, and the second shows a Marine Corps squad\u0027s involvement in a brutal battle in Vietnam.",
    "PhotoName": "Full Metal Jacket_644ce9b11e2c5fd6f373aec7.png",
    "Genre": 4,
    "ReleaseDate": "1987-07-26T12:48:40",
    "AgeRating": 4
  },
  {
    "Id": "644d22de281393c24493eb48",
    "Title": "Snow piercer",
    "Description": "In a world covered in ice, the last remaining humans live on a train that endlessly circles the globe. However, social divisions within the train lead to a rebellion from the back compartments aimed at seizing power and control over the train\u0027s movement.",
    "PhotoName": "Snow piercer_644d22de281393c24493eb47.png",
    "Genre": 1,
    "ReleaseDate": "2013-07-11T16:49:57.726",
    "AgeRating": 4
  },
  {
    "Id": "644d2401281393c24493eb4a",
    "Title": "No country for old man",
    "Description": "Hitman Anton Chigurh has escaped from prison and sets out on the hunt for prey in Texas in the 1980s. Sheriff Ed Tom Bell tries to catch Chigurh, but is faced with crimes, violence, and corruption within the confines of his small town.",
    "PhotoName": "No country for old man_644d2401281393c24493eb49.png",
    "Genre": 4,
    "ReleaseDate": "2007-05-21T17:00:30.466",
    "AgeRating": 4
  },
  {
    "Id": "644d24a4281393c24493eb4c",
    "Title": "The thing",
    "Description": "An American scientific research team in Antarctica discovers an extraterrestrial life form that is capable of taking the shape of any living creature. They begin to fight for survival, not knowing who among them is infected by the alien and who is not.",
    "PhotoName": "The thing_644d24a4281393c24493eb4b.png",
    "Genre": 1,
    "ReleaseDate": "1982-06-25T17:04:50",
    "AgeRating": 4
  },
  {
    "Id": "644d2632281393c24493eb4e",
    "Title": "The hateful eight",
    "Description": "Eight strangers seek shelter from a blizzard in a remote, abandoned town in Wyoming. As they begin to get to know each other, it becomes clear that not all of them are honest and someone present is hiding their true intentions.",
    "PhotoName": "The hateful eight_644d2632281393c24493eb4d.png",
    "Genre": 5,
    "ReleaseDate": "2015-12-25T17:07:34",
    "AgeRating": 4
  },
  {
    "Id": "644d26b1281393c24493eb50",
    "Title": "Pulp fiction",
    "Description": "A cult classic film by Quentin Tarantino in which the storylines of various characters intertwine: two hitmen, a boxer, a gangster, his wife, and many others. The film explores a plethora of themes, including violence, religion, love, betrayal, and treachery.",
    "PhotoName": "Pulp fiction_644d26b1281393c24493eb4f.png",
    "Genre": 1,
    "ReleaseDate": "1994-10-14T17:14:12",
    "AgeRating": 4
  },
  {
    "Id": "644d2775281393c24493eb52",
    "Title": "Once upon a time in Hollywood",
    "Description": "Rick Dalton, a famous TV actor from the 60s, and his stunt double Cliff Booth struggle for success in Hollywood in 1969. The film showcases life in Hollywood in the late 60s, with a focus on the relationships between celebrities and their assistants.",
    "PhotoName": "Once upon a time in Hollywood_644d2774281393c24493eb51.png",
    "Genre": 2,
    "ReleaseDate": "2019-07-26T17:17:19.518",
    "AgeRating": 4
  },
  {
    "Id": "644d27d9281393c24493eb54",
    "Title": "Inglorious busters",
    "Description": "During World War II, Lieutenant Aldo Raine and his team of European American soldiers go on a mission in Nazi Germany to kill as many Nazi soldiers as possible. Meanwhile, SS Captain Hans Landa attempts to establish contact with a movie star and her team in Germany.",
    "PhotoName": "Inglorious busters_644d27d9281393c24493eb53.png",
    "Genre": 2,
    "ReleaseDate": "2009-08-20T17:19:34",
    "AgeRating": 4
  },
  {
    "Id": "644d28c2281393c24493eb56",
    "Title": "Django unchained",
    "Description": "In 1858 in the southern United States, former slave Django teams up with a white bounty hunter to rescue his wife from a cruel slave owner. The film explores themes of racism, violence, and revenge in southern society before the Civil War.",
    "PhotoName": "Django unchained_644d28c2281393c24493eb55.png",
    "Genre": 5,
    "ReleaseDate": "2012-12-25T17:21:14",
    "AgeRating": 4
  },
  {
    "Id": "644d293d281393c24493eb58",
    "Title": "Reservoir dogs",
    "Description": "A group of criminals who use color-coded aliases gather together to rob a jewelry store. However, their plan turns into a bloody massacre and each of them begins to suspect that someone among them is a police informant.",
    "PhotoName": "Reservoir dogs_644d293d281393c24493eb57.png",
    "Genre": 4,
    "ReleaseDate": "1992-10-23T17:25:07",
    "AgeRating": 4
  },
  {
    "Id": "644d29be281393c24493eb5a",
    "Title": "Lobster",
    "Description": "In an alternative future, people who remain single are sent to a hotel where they have 45 days to find a partner or they will be turned into an animal of their choice. One of the guests tries to escape but eventually joins an unconventional group of runaways.",
    "PhotoName": "Lobster_644d29be281393c24493eb59.png",
    "Genre": 0,
    "ReleaseDate": "2015-05-13T17:27:11",
    "AgeRating": 4
  },
  {
    "Id": "644d2a79281393c24493eb5c",
    "Title": "Gran Torino",
    "Description": "Walt Kowalski, a grumpy Korean War veteran and a lifelong resident of Detroit, hates all non-Americans, especially Asian immigrants. However, when his young Hmong neighbor becomes the target of a gang, Walt is forced to protect him and help him become a man.",
    "PhotoName": "Gran Torino_644d2a79281393c24493eb5b.png",
    "Genre": 4,
    "ReleaseDate": "2009-01-09T17:29:19",
    "AgeRating": 4
  },
  {
    "Id": "644d2c3f281393c24493eb5e",
    "Title": "Shawshank redemption",
    "Description": "Andy Dufresne is wrongly imprisoned for a double murder and suffers abuse from inmates and guards. With the help of his friend Red, he maintains hope and helps fellow inmates find purpose and freedom.",
    "PhotoName": "Shawshank redemption_644d2c3f281393c24493eb5d.png",
    "Genre": 4,
    "ReleaseDate": "1994-09-23T17:34:21.61",
    "AgeRating": 4
  },
  {
    "Id": "644d2ccc281393c24493eb60",
    "Title": "Green mile",
    "Description": "New corrections officer Paul Edgecomb befriends death row inmate John Coffey, who possesses healing powers. They endure cruelty from prison guards, leading Paul to question the justice system as John\u0027s execution approaches.",
    "PhotoName": "Green mile_644d2ccc281393c24493eb5f.png",
    "Genre": 4,
    "ReleaseDate": "1999-12-10T17:40:01",
    "AgeRating": 4
  },
  {
    "Id": "644d2d4a281393c24493eb62",
    "Title": "Goodfellas",
    "Description": "Henry Hill fulfills his dream of becoming a gangster by joining the Lucchese crime family and becoming Jimmy Conway\u0027s right-hand man. However, their criminal activities attract attention from federal agencies and they end up in prison, bringing their career to an end.",
    "PhotoName": "Goodfellas _644d2d4a281393c24493eb61.png",
    "Genre": 4,
    "ReleaseDate": "1990-09-19T17:42:21",
    "AgeRating": 4
  },
  {
    "Id": "644d2e53281393c24493eb64",
    "Title": "The Irishman",
    "Description": "Hitman Frank Sheeran recounts his life story, spanning decades of criminal activity, including murders, betrayals, and loss of friends. As he reflects on his experiences, he realizes he\u0027s on the brink of destruction...",
    "PhotoName": "The Irishman_644d2e53281393c24493eb63.png",
    "Genre": 4,
    "ReleaseDate": "2019-09-27T17:44:28",
    "AgeRating": 4
  },
  {
    "Id": "644d2f42281393c24493eb66",
    "Title": "The wolf of wall street",
    "Description": "The film is about Jordan Belfort, a broker who becomes a millionaire at 26 but is arrested for fraud and money laundering. Leonardo DiCaprio stars in the movie, which showcases the excesses and black humor of wealthy and reckless brokers.",
    "PhotoName": "The wolf of wall street_644d2f42281393c24493eb65.png",
    "Genre": 2,
    "ReleaseDate": "2013-12-25T17:48:52",
    "AgeRating": 4
  },
  {
    "Id": "644d308b281393c24493eb68",
    "Title": "Shutter island",
    "Description": "Leonardo DiCaprio plays a U.S. Marshal investigating a missing patient at a psychiatric hospital on Shutter Island. As he uncovers the truth, he questions his own sanity. The film is based on a novel by Dennis Lehane and offers a captivating and thrilling mystery.",
    "PhotoName": "Shutter island_644d308b281393c24493eb67.png",
    "Genre": 4,
    "ReleaseDate": "2010-02-19T17:52:51",
    "AgeRating": 4
  },
  {
    "Id": "644d3161281393c24493eb6a",
    "Title": "Interstellar",
    "Description": "The film features Matthew McConaughey as a scientist embarking on a space mission to find a new habitable planet for humanity as Earth is on the brink of collapse. Directed by Christopher Nolan, the movie showcases stunning space visuals and scientific themes.",
    "PhotoName": "Interstellar_644d3161281393c24493eb69.png",
    "Genre": 4,
    "ReleaseDate": "2014-11-05T17:59:43.857",
    "AgeRating": 3
  },
  {
    "Id": "644d327f281393c24493eb6c",
    "Title": "The dark knight",
    "Description": "The movie revolves around Batman\u0027s efforts to stop Joker from creating chaos in Gotham. The film\u0027s intense plot, exceptional performances, and unique atmosphere have made it a standout superhero movie.",
    "PhotoName": "The dark knight_644d327f281393c24493eb6b.png",
    "Genre": 1,
    "ReleaseDate": "2008-07-18T18:01:54",
    "AgeRating": 3
  },
  {
    "Id": "644d337f281393c24493eb6e",
    "Title": "Memento",
    "Description": "The non-linear plot jumps between past and present, as the viewer pieces together the clues with the hero. Director Christopher Nolan creates a tense atmosphere as Leonard struggles with his amnesia and dangerous criminals.",
    "PhotoName": "Memento_644d337f281393c24493eb6d.png",
    "Genre": 1,
    "ReleaseDate": "2000-10-11T18:06:40",
    "AgeRating": 4
  },
  {
    "Id": "644d34b3281393c24493eb70",
    "Title": "Tenet",
    "Description": "The film is known for its stunning special effects and complex, engaging plot that gradually reveals mysteries and puzzles, leaving the audience captivated. It is a must-watch for all fans of science fiction and action.",
    "PhotoName": "Tenet _644d34b3281393c24493eb6f.png",
    "Genre": 1,
    "ReleaseDate": "2023-04-29T18:10:56.3765491+03:00",
    "AgeRating": 3
  },
  {
    "Id": "644d353d281393c24493eb72",
    "Title": "The prestige",
    "Description": "The movie is directed by Christopher Nolan and features a talented cast, including Hugh Jackman and Christian Bale. \u0022The Prestige\u0022 is a captivating tale of mystery, deception, and sacrifice that will keep you guessing until the very end.",
    "PhotoName": "The prestige_644d353d281393c24493eb71.png",
    "Genre": 4,
    "ReleaseDate": "2006-10-20T18:16:04",
    "AgeRating": 3
  },
  {
    "Id": "644d35e4281393c24493eb74",
    "Title": "Inception",
    "Description": "Inception follows the story of Cobb, a thief skilled in extracting confidential information from the subconscious, who is tasked with implanting an idea into the mind of a dying businessman. With his team, he enters a dangerous world where every action has real-world consequences",
    "PhotoName": "Inception_644d35e4281393c24493eb73.png",
    "Genre": 1,
    "ReleaseDate": "2010-07-16T18:18:22",
    "AgeRating": 3
  }
]